I tried below sample 
```
resource "ibm_resource_instance" "test" {
  name     = "test"
  service  = "toolchain"
  plan     = "lite"
  location = "us-south"
}
```

```
Harinis-MacBook-Pro:toolchain hkantare$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_resource_instance.test will be created
  + resource "ibm_resource_instance" "test" {
      + crn                     = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "us-south"
      + name                    = "test"
      + plan                    = "lite"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + service                 = "toolchain"
      + status                  = (known after apply)
      + tags                    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_resource_instance.test: Creating...

Error: toolchain cannot be provisioned by resource controller

  on main.tf line 1, in resource "ibm_resource_instance" "test":
   1: resource "ibm_resource_instance" "test" {
```